Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: It is worth noting that when using the HTML5 module, you can use this function to make the canvas background transparent, which will then permit any images being used in the host HTML to be seen with the game running over them.
zh_cn: 当使用HTML5模式的时候需要注意，你可以使用本函数使一个canvas背景透明，它允许你在游戏运行的时候从网络上载入一些图像。

source: It returns -1 if there are no further notifications queued, or a real value otherwise representing the ID for the notification.
zh_cn: 返回 -1 代表之后已没有通知，返回其他的真值为通知的ID。

source: It returns -1 if there are no notifications queued, or a real value otherwise representing the ID for the notification.
zh_cn: 返回 -1 代表通知队列为空即没有通知，返回其他的真值为通知的ID。

source: It should be noted that this function only works properly when used on the Windows target.
zh_cn: 应该注意的是，这个函数只在windows平台有效。

source: It uses two modifier keys to do this: Left and Left .
zh_cn: 它使用两个组合键来实现这一点：左 和 左 .

source: It uses two modifier keys to do this: Left / and Left .
zh_cn: 有两个控制键用于这些操作： 左 / 和 左 。

source: It will append to the selected file unless an alternative is selected.
zh_cn: 如果没有选择替代项，则它会被附加到所选文件中。

source: It will first open the file explorer so that you can select where you want to save the project and then compile the game.
zh_cn: 它首先会打开文件浏览器以便你选择要保存的位置，然后编译游戏。

source: It will only disappear when you explicitly destroy it, either with a destroy action or in code.
zh_cn: 当您明确地销毁它时，它将只会消失，或者使用destroy操作或代码。

source: It will open the "Save" dialogue and prompt you to choose a location to save the new project to.
zh_cn: 这会打开“保存（Save）”对话框并要求您选择存储新项目的位置。

source: It will reset the AudioGroup back to Default.
zh_cn: 它会将音频组重置回默认。

source: It will return true for portrait and false for landscape.
zh_cn: 纵向返回 真横向返回 假。

source: It will return true if you have active the alternative method v-sync method, or false if you are using the regular v-sync option.
zh_cn: 如果你激活了垂直同步的替代方法（断水注：并非返回垂直同步是否激活，而是指替代方法），它将返回true ，或者如果你使用常规的垂直同步方式，它则返回false 。

source: It's best to give each sprite a descriptive name so that you can identify at a glance whether a particular resource is a sprite or an object or anything else, and many people do this by prefixing or suffixing the resource with the letters "spr" - for example, "spr_Ball".
zh_cn: 最好给每个精灵一个描述性的名字，这样你就可以一目了然地识别一个特定的资源是一个精灵还是一个物体或其他任何种类的资源，许多人通过给字符串 “spr” 加上前缀或后缀来做到这一点 - 例如“spr_Ball”。

source: It's exactly the same.
zh_cn: 它们完全相等。

source: It's important to note that when you use the @function identifier, then the script name that you give there will show in the IDE just the same as the script name in the resource tree.
zh_cn: 请务必注意，当你使用@function标识符的时候，在IDE中是显示和资源树中一致的脚本名。

source: It's obviously harder to see here, but the overflows ripple along until there are no ones in a column - or 2 at which point an overflow bit makes 3 and it stays there.
zh_cn: 这里看起来显然比较困难，但是会一直溢出，直到列中没有一个数 - 或者哪一位为 2，溢出导致 3，它就会停留在那里。

source: It's worth noting that all docked windows can be hidden/unhidden individually by clicking the button to the side of the docked items (highlighted in the image at the top of this page), or you can hide/unhide all docked items using the quickbutton at the top of the IDE, and note too that the IDE will remember docked windows between sessions.
zh_cn: 值得注意的是，所有停靠的窗口可以通过点击停靠的窗口侧面的按钮（在上图中突出显示）单独隐藏/取消隐藏，或者您可以使用IDE的顶部的快捷键 隐藏/取消隐藏所有停靠的窗口，并注意 IDE 会记住每个会话中的停靠窗口。

source: It's worth noting that an array always starts at 0 and can never be negative!
zh_cn: 需要注意的是数组编号 开始于0 并且 永远不能为负数。

source: It's worth noting that the <filename> in -output and -debugoutput can be the same one if desired, as the file is opened and closed on each write.
zh_cn: 值得注意的是，如果需要，-output 和 -debugoutput 两个选项的 <filename> 参数可以是相同的，文件在每次写入时都会被打开并关闭（不需要担心文件句柄被占用的问题）。

source: Italic
zh_cn: 斜体

source: Item
zh_cn: 项

source: Item '{0}' is locked, unlock to allow editing
zh_cn: 项目 '{0}' 被锁定，解锁以允许编辑

source: Item Group ID
zh_cn: 项目组 ID

source: Item Group Id
zh_cn: 项目组Id

source: Items '{0}' are locked, unlock to allow editing
zh_cn: 项目 '{0}' 被锁定，解锁以允许编辑

source: Iterations:
zh_cn: 迭代数：

source: It’s also worth noting, that computers can only add (or subtract, multiply or divide) 2 numbers at once, even SIMD is based on 2 calculations at once, but doing multiple calculations in parallel.
zh_cn: 值得注意的是，计算机一次只能加（或减、乘、除）2 个数字，即使单指令多数据流同时基于 2 个计算，但并行执行多个计算。

source: JDK Max Heap Size
zh_cn: JDK 最大堆大小

source: JDK Max Heap Size (in GB)
zh_cn: JDK 最大堆大小 (1GB以内?)

source: JDK maximum heap size (GB)
zh_cn: JDK 最大堆大小 (GB)

source: JDK not installed correctly at location entered in Android Platform Settings
zh_cn: 在Android平台设置中输入的位置未正确安装JDK

source: JSDoc Example
zh_cn: JSDoc 范例

source: JSDoc Import Example
zh_cn: JSDoc导入范例

source: JSDoc Script Comments
zh_cn: JSDoc 脚本注释

source: Java JDK Location
zh_cn: Java JDK 位置

source: Java JDK location
zh_cn: Java JDK 位置

source: JavaDoc Script Comments
zh_cn: JSDoc 脚本注释

source: Join
zh_cn: 加入

source: Joints
zh_cn: 关节

source: Jump To Point
zh_cn: 跳到指定点

source: Jump To Start
zh_cn: 跳转到起点

source: Jump to the instance's start position.
zh_cn: 跳转到实例的起始位置。

source: Jump to the specified position.
zh_cn: 跳转到指定位置。

source: Just below the colour picker we have our tools - these are the different drawing tools, including the brush, flood fill, masking and shape tools.
zh_cn: 在颜色选择器下面是工具 - 这些是各种绘图工具，包括刷子，填充，遮罩和形状工具。

source: Just for information; this will always be locked for this platform
zh_cn: 仅作为信息，在该平台下它会始终保持锁定。

source: Just like any other variable, it can be anything you want from simply "a" to "mymumscow".
zh_cn: 和其他所有变量都一样，它可以是你所想的任何东西，比如"a"或者"mymumscow"。

source: Just like normal additions, we add numbers together and then we overflow into the next column, but unlike a normal decimal addition, we can only go to 1, not 9.
zh_cn: 就像正常的加法，数字加起来然后溢出到下一列中，但是不同于普通的十进制加法，只会进到 1，没有 9。

source: Just like normal variables, you can pass arrays through to scripts to be used and then returned to the instance that called the script.
zh_cn: 就像普通的变量，你也可以传递数组到脚本中，并返回到调用这个脚本的实例中。

source: Keep All
zh_cn: 保留全部

source: Keep Aspect Ratio
zh_cn: 保持长宽比例

source: Keep Changed
zh_cn: 保留更改

source: Keep Tabs
zh_cn: 保持tabs

source: Keep aspect ratio
zh_cn: 保持长宽比

source: Keep tabs
zh_cn: 保持tab键缩进对齐

source: Key
zh_cn: 键

source: Key 0
zh_cn: 密钥 0

source: Key 1
zh_cn: 密钥 1

source: Key 2
zh_cn: 密钥 2

source: Key 3
zh_cn: 密钥 3

source: Key 4
zh_cn: 密钥 4

source: Key Binding
zh_cn: 绑定键位

source: Key Down
zh_cn: 压住键

source: Key Down -
zh_cn: 压住键 -

source: Key Hash
zh_cn: 密钥哈希

source: Key Hash (SHA1)
zh_cn: 密钥哈希 (SHA1)

source: Key Press -
zh_cn: 按下键 -

source: Key Pressed
zh_cn: 按下键

source: Key Up
zh_cn: 松开键

source: Key Up -
zh_cn: 松开键 -

source: Key:
zh_cn: 键：

source: Keyboard Shortcuts
zh_cn: 键盘快捷键

source: Keyboard/Keyboard Pressed/Keyboard Released
zh_cn: 键盘/键盘按下/键盘放开事件

source: Keypad
zh_cn: 小键盘

source: Keypad {0}
zh_cn: 小键盘 {0}

source: Keys And Doors
zh_cn: 钥匙与门

source: Keystore
zh_cn: 密钥库

source: Keyword
zh_cn: 关键字

source: Keyword help
zh_cn: 关键字帮助

source: Keywords
zh_cn: 关键字

source: Kinematic
zh_cn: 运动的

source: Knowledge Base
zh_cn: 知识库

source: LMB + ALT to paint with selected object resources
zh_cn: 鼠标左键 + ALT 使用选中的物体资源涂抹

source: LMB + ALT to paint with selected sprite resources
zh_cn: 鼠标左键 + ALT 使用选中的精灵资源涂抹

source: LMB + Right ALT to paint with selected object resources
zh_cn: 鼠标左键 + 右ALT 使用选中的物体资源涂抹

source: LMB + Right ALT to paint with selected sprite resources
zh_cn: 鼠标左键 + 右ALT 使用选定的精灵资源涂沫

source: LMB + T to translate path, LMB + R to rotate path, LMB + S to scale path
zh_cn: 鼠标左键 + T 平移路径， 鼠标左键 + R 旋转路径，鼠标左键 + S 缩放路径

source: Label
zh_cn: 标签

source: Landscape
zh_cn: 横向

source: Landscape Splash Screen
zh_cn: 横向启动画面

source: Language
zh_cn: 语言

source: Language Features
zh_cn: 语言特性

source: Language Select
zh_cn: 语言选择

source: Languages
zh_cn: 语言

source: Languages XML
zh_cn: 语言 XML

source: Laptop Mode
zh_cn: 笔记本电脑模式（Laptop Mode）

source: Laptop Mode ({0})
zh_cn: 笔记本电脑模式 ({0})

source: Laptop file watcher frequency (ms)
zh_cn: 笔记本电脑文件观察频率 (毫秒)

source: Laptop mode combines with some tools in the IDE to make it a much better experience when using a touchpad, simplifying the 3 main mouse interactions: Pan, zoom and scroll.
zh_cn: IDE中的笔记本模式融合了一些工具使得当你使用触控板的时候能够拥有更好的体验，简化了三个主要的鼠标交互：平移、缩放和滚动。

source: Large
zh_cn: 大

source: Large Image
zh_cn: 大图

source: Large Logo
zh_cn: 大Logo

source: Last Changed
zh_cn: 最后更改

source: Launch Project Failed
zh_cn: 启动项目失败

source: Launch Simulator
zh_cn: 启动模拟器

source: Launch the help file
zh_cn: 启动帮助文件

source: Layer
zh_cn: 层

source: Layer '{0}' is locked, unlock to allow editing
zh_cn: 层 '{0}' 被锁定，解锁以允许编辑

source: Layer Depth Error
zh_cn: 层深度错误

source: Layer Name
zh_cn: 层名称

source: Layer Properties
zh_cn: 图层属性

source: Layer View
zh_cn: 层视图

source: Layer name cannot be blank
zh_cn: 层名称不能为空

source: Layers
zh_cn: 图层

source: Layers '{0}' are locked, unlock to allow editing
zh_cn: 层 '{0}' 被锁定，解锁以允许编辑

source: Layers - {0}
zh_cn: 层 - {0}

source: Layers are ordered by depth and this depth is what defines the order in which the layer contents will be rendered to the screen when the game runs.
zh_cn: 层按 深度 排序，这个深度定义了游戏运行时层内容被渲染到屏幕上的顺序。

source: Layout
zh_cn: 布局

source: Layout Groups
zh_cn: 布局组

source: Layout Hierarchy
zh_cn: 布局层级

source: Layout Wizard
zh_cn: 布局向导

source: Layout name:
zh_cn: 布局名称：

source: Layout wizard layout is missing.
zh_cn: 布局向导的布局丢失。

source: Layouts
zh_cn: 布局

source: Layouts Menu
zh_cn: 布局菜单

source: Learn
zh_cn: 学习

source: Learn More
zh_cn: 了解更多

source: Leave this field blank to skip codesigning.
zh_cn: 保留这个字段空白以跳过数字签名。

# Leave this field blank to skip codesigning.
source: Leave\nthis field blank to skip codesigning.
zh_cn: 留空\n这个字段空白以跳过数字签名。

source: Left
zh_cn: 左

source: Left Arrow
zh_cn: 方向键左

source: Left Down
zh_cn: 左键压住

source: Left Edge
zh_cn: 左边界

source: Left Mouse Button: Add & Drag Anchor
zh_cn: 鼠标左键(LMB)：添加&拖动锚点

source: Left Or Right Click To Set Eraser
zh_cn: 左键或右键点击设置橡皮擦

source: Left Pressed
zh_cn: 左键按下

source: Left Released
zh_cn: 左键放开

source: Left Stick
zh_cn: 左摇杆

source: Left Stick (Horizontal)
zh_cn: 左摇杆 (水平)

source: Left Stick (Vertical)
zh_cn: 左摇杆 (垂直)

source: Left Trigger
zh_cn: 左触发器

source: Left/right click to pick a colour
zh_cn: 左/右点击选取一个颜色

source: Left:
zh_cn: 左：

source: Less
zh_cn: 小于

source: Less or Equal
zh_cn: 小于或等于

source: Let's look at a typical object setup with events and code:
zh_cn: 我们来看一个典型的对象设置，包括事件和代码：

source: Let's say we want a simple animation counter, counting from 0 to to 15 (as we have 16 frames of animation), now we can either do an increment, and then do an IF, or we can use our knowledge of binary and remove the IF completely.
zh_cn: 假设我们需要一个简单的动画计数器，从 0 到 15(因为我们有 16 帧的动画)，现在我们可以做一个递增，然后做一个 IF 判断，或者我们可以使用我们的二进制知识并完全不需要 IF 语句。

source: Let's say we wanted to set bit 27, what number is that?
zh_cn: 假设我们希望设置第 27 号位，那么数字将会是多少呢？

source: Let's take a quick look at how you do division, and why it's going to be so useful.
zh_cn: 我们快速的看一下你是如何做除法的，以及为什么这很有用。

source: Let's take a simple number - 64 - and divide by 32:
zh_cn: 我们取一组简单的数——64，然后除以 32

source: Let's take a slightly more complicated number as a further example: 23.
zh_cn: 我们再看一个稍微更复杂的数字作为进一步的例子： 23。

source: Let's take some very simple examples first.
zh_cn: 我们先来看一个非常简单的例子。

source: Letters
zh_cn: 字母

source: Libraries
zh_cn: 库

source: Library
zh_cn: 库

source: Library cannot be deleted.
zh_cn: 无法删除该库。

source: Library saved.
zh_cn: 库已保存。

source: Licence Renewal
zh_cn: 许可证续订

source: Licence does not have permission to access this build
zh_cn: 许可证无权访问此版本

source: Licence doesn't match expected format - please login again.\nIf you keep seeing this message contact the helpdesk at accounts.yoyogames.com/contact-us
zh_cn: 许可证与预期格式不匹配 - 请重新登录。\n如果你还会看到这条消息请前往 accounts.yoyogames.com/contact-us 联系客服

source: Licence file is not there
zh_cn: 许可证文件不存在

source: Licence file missing
zh_cn: 许可证文件丢失

source: Licence has expired
zh_cn: 许可证已过期

source: Licence is invalid
zh_cn: 许可证无效

source: Licence local id doesn't match expected format - please login again.\nIf you keep seeing this message contact the helpdesk at accounts.yoyogames.com/contact-us
zh_cn: 许可证的本地id与预期格式不匹配 - 请重新登录。\n如果你还会看到这条消息请前往 accounts.yoyogames.com/contact-us 联系客服

source: Licences
zh_cn: 许可证

source: License Agreement
zh_cn: 许可协议

source: Licenses
zh_cn: 许可证

source: Licensing
zh_cn: 授权

source: Light
zh_cn: 明

source: Like this:
zh_cn: 如下：

source: Like undo, you have multiple levels of redo too.
zh_cn: 和撤销一样，你也可以进行多重重做。

source: Line
zh_cn: 行

source: Line (L)
zh_cn: 线条(L)

source: Line Colour
zh_cn: 线条颜色

source: Line Number ({0} - {1})
zh_cn: 行号 ({0} - {1})

source: Line Number Text
zh_cn: 行号文本

source: Line numbers
zh_cn: 行号

source: Line tool
zh_cn: 直线工具

source: Linear
zh_cn: 线性

source: Linear Damping
zh_cn: 线性阻尼

source: Link Label
zh_cn: 链接标签

source: Link groups
zh_cn: 连接组

source: Link to Amazon Submission Guide
zh_cn: 链接到Amazon提交指南

source: Linker Flags:
zh_cn: 连接器标志（Flags）：

source: List
zh_cn: 列表

source: List Items
zh_cn: 列表项

source: List View
zh_cn: 列表视图

source: List items
zh_cn: 列表项

source: Listbox
zh_cn: 列表框

source: Lists
zh_cn: 列表

source: Live Preview
zh_cn: 实时预览

source: Lives
zh_cn: 生命数

source: Load Buffer
zh_cn: 载入缓冲区

source: Load Game
zh_cn: 载入游戏

source: Load Layout
zh_cn: 载入布局

source: Load Layout File
zh_cn: 载入布局文件

source: Load Library
zh_cn: 载入库

source: Load a file into a buffer.
zh_cn: 文件加载到一个缓冲区。

source: Load a project from disk
zh_cn: 从硬盘载入工程

source: Load texture/surface images from the target
zh_cn: 从目标载入表面/纹理图像

source: Load the game from a save file.
zh_cn: 从一个存档文件中载入游戏。

source: Load the project instead of adding a datafile?
zh_cn: 载入项目而不是添加一个数据文件？

source: Load the project?
zh_cn: 载入项目？

source: Loading Bar Extension
zh_cn: 进度条扩展包

source: Loading Custom Languages...
zh_cn: 正在加载自定义语言...

source: Loading Devices...
zh_cn: 载入设备...

source: Loading Languages...
zh_cn: 载入语言...

source: Loading Plugins...
zh_cn: 载入插件...

source: Loading Preferences...
zh_cn: 载入偏好设置...

source: Loading bar extension
zh_cn: 进度条扩展

source: Loading...
zh_cn: 载入中...

source: Loading....
zh_cn: 载入....

source: Local
zh_cn: 本地

source: Local Machine ID mismatch
zh_cn: 本地机器ID不匹配

source: Local Machine ID missing
zh_cn: 本地机器ID丢失

source: Local Notifications
zh_cn: 本地通知

source: Local Variable
zh_cn: 本地变量

source: Local Variables
zh_cn: 局部变量

source: Localisation Files
zh_cn: 本地化文件

source: Localised manual not installed
zh_cn: 未安装本地化帮助文档

source: Locals
zh_cn: 局部

source: Location
zh_cn: 位置

source: Location:
zh_cn: 位置：

source: Lock Graphic
zh_cn: 锁定图形

source: Lock Instance
zh_cn: 锁定实例

source: Lock sprite origin
zh_cn: 锁定精灵原点

source: Locked Functions
zh_cn: 受到封锁的函数

source: Locked properties frame colour
zh_cn: 锁定项属性框颜色

source: Locked selection bounds colour
zh_cn: 所有锁定项选框边界颜色

source: Locked selection frame colour
zh_cn: 锁定项的选择框颜色

source: Login
zh_cn: 登录

source: Login successful
zh_cn: 登录成功

source: Logo Background Colour
zh_cn: Logo背景色

source: Logo Foreground Text Colour
zh_cn: Logo 前景文本颜色

source: Logo Image
zh_cn: Logo 图片

source: Logo background colour
zh_cn: Logo 背景颜色

source: Logout
zh_cn: 登出

# Logout user '{0}'? This will save any changes and restart the IDE.
source: Logout user '{0}'?\nThis will save any changes and restart the IDE.
zh_cn: 登出帐户 '{0}'吗？\n这将保存所有更改并重启IDE。

source: Long Description
zh_cn: 详细描述

source: Loop
zh_cn: 循环

source: Loop mode
zh_cn: 循环模式

source: Loop playback
zh_cn: 循环播放

source: Loop playback for all sounds in group
zh_cn: 循环播放组中所有声音

source: Looping Counters
zh_cn: 循环计数器

source: Loops
zh_cn: 循环

source: Lowering this value may help performance on lower end machines.
zh_cn: 降低该值可能有助于在低配置机器上发挥更好的性能。

source: Mac App Store Category
zh_cn: 苹果应用商店（Mac App Store）分类

source: Mac Closed beta forums
zh_cn: Mac封闭测试论坛

source: Mac OS X
zh_cn: Mac OS X 模块

source: Mac OSX El Capitan or higher
zh_cn: Mac OSX El Capitan 或更高

source: Mac and Ubuntu (Linux)
zh_cn: Mac和Ubuntu (Linux)

source: Macro
zh_cn: 宏常量

source: Macros
zh_cn: 宏常量

source: Magic wand tool
zh_cn: 魔棒工具

source: Main
zh_cn: 主要

source: Main Options
zh_cn: 主要设置

source: Maintain Aspect Ratio:
zh_cn: 保持长宽比：

source: Maintainer Email
zh_cn: 维护者邮箱

source: Make Favourite
zh_cn: 设置最喜爱

source: Making A Checkpoint
zh_cn: 制作一个检查点

source: Malformed...
zh_cn: 语句结构异常...

source: Manage
zh_cn: 管理

source: Manage Account
zh_cn: 管理账户

source: Manage Configurations
zh_cn: 管理配置

source: Managed to enter none state
zh_cn: 管理进入“无”状态

source: Manual
zh_cn: 帮助文档

source: Manual Language
zh_cn: 帮助文档语言

source: Manual download failed
zh_cn: 帮助文档下载失败

source: Manual not localised
zh_cn: 帮助文档未本地化

source: Map
zh_cn: 映射

source: Margin
zh_cn: 边距

source: Marketplace
zh_cn: 市场

source: Marketplace Menu
zh_cn: 市场菜单

source: Marketplace Package Detected
zh_cn: 检测到市场扩展包

source: Marketplace cannot be accessed from the Trial version of GameMaker Studio 2.
zh_cn: GameMaker Studio 2的试用版不支持访问市场。

source: Marketplace cannot be accessed in GameMaker Studio 2 Trial
zh_cn: GameMaker Studio 2 试用版无法访问市场

source: Marketplace will be available on Steam soon.
zh_cn: 市场功能不久之后将在Steam上可用

source: Marketplace will open when a connection has been established.
zh_cn: 市场将在建立连接后打开。

source: Mask
zh_cn: 遮罩

source: Mask overlay colour
zh_cn: 蒙版覆盖区域颜色

source: Master
zh_cn: 主干

source: Match indent on new lines
zh_cn: 在另起行保持缩进

source: Mathematics
zh_cn: 数学

source: Matrix Functions
zh_cn: 矩阵函数

source: Matrix index
zh_cn: 矩阵索引

source: Max
zh_cn: 最大

source: Max Angle
zh_cn: 最大角度

source: Max Color
zh_cn: 最大颜色

source: Max Colour
zh_cn: 最大颜色值

source: Max Dir
zh_cn: 最大方向

source: Max Life
zh_cn: 最大生命周期

source: Max Size
zh_cn: 最大尺寸

source: Max Speed
zh_cn: 最大速度

source: Max parallel jobs to use when compiling.
zh_cn: 编译时使用最大的并行计算。

source: Maximum
zh_cn: 最大化

source: Maximum logins exceeded \nYou can manage your account sessions at accounts.yoyogames.com
zh_cn: 超出最大登录数 \n您可以在accounts.yoyogames.com管理您的帐户会话

source: Maximum number of recently used actions to display
zh_cn: 最近使用动作的最大显示数目

source: Maximum number of resources to open simultaneously before warning
zh_cn: 发出警告前同时打开资源的最大数目

source: Maximum number of resources to open simultaneously without warning
zh_cn: 在没有警告的情况下同时打开的最大资源数

source: Maximum number of resources to open simultaniously before warning
zh_cn: 发出警告前能同时打开的最大资源数目

source: Maximum number of search results to display
zh_cn: 要显示的最大搜索结果数

source: Maximum parallel compile jobs
zh_cn: 最大并行编译作业

source: Maximum size for DnD™ toolbox action thumbnails
zh_cn: DnD™工具栏动作缩略图的最大尺寸

source: Maximum windows to display
zh_cn: 可显示窗口的最大数量

source: Maximum zoom (%)
zh_cn: 最大缩放倍数 (%)

source: Maybe that still doesn't clarify things too much, so let's give some examples...
zh_cn: 也许这还不清楚事情太多了，所以让我们举一些例子

source: Medium
zh_cn: 中

source: Medium Back Flip Image
zh_cn: 向后翻转的中等图片

source: Medium Front Flip Image
zh_cn: 向前翻转的中等图片

source: Medium Image
zh_cn: 中图

source: Mem Avg {0}
zh_cn: 内存平均使用量 {0}

source: Mem {0}
zh_cn: 内存使用量 {0}

source: Memory Usage
zh_cn: 内存占用量

source: Memory:
zh_cn: 内存：

source: Menu Bar
zh_cn: 菜单栏

source: Menu Bar Entry
zh_cn: 菜单栏项目

source: Menu Entry
zh_cn: 菜单项

source: Menu Expression Input
zh_cn: 菜单表达式输入

source: Menu Input
zh_cn: 菜单输入

source: Menus.
zh_cn: 菜单。

source: Merge
zh_cn: 合并

source: Merge Moments
zh_cn: 合并时刻点

source: Merge Selected Layers
zh_cn: 合并选中的图层

source: Merge Tool Options
zh_cn: 合并工具选项

source: Merge Tool path is invalid
zh_cn: 合并工具路径无效

source: Merge all layers
zh_cn: 合并所有图层

source: Merge group
zh_cn: 合并组

source: Merge in Progress
zh_cn: 合并进行中

source: Merge layer down
zh_cn: 向下合并图层

source: Merge pixels along the edge of the graphic to correct interpolation
zh_cn: 合并沿着图形边缘的像素以校正插值

source: Merge the selected moments
zh_cn: 融并所选时刻

source: Merging moments is a permanent action that cannot be undone.
zh_cn: 合并“时刻”是一个不能撤消的永久性操作。

source: Merging the selected moments will result in conversion from DnD™ to GameMaker Language.
zh_cn: 合并选定的时刻点将导致从DnD™转换为GML。

source: Message
zh_cn: 消息

source: Message for Commit - {0}
zh_cn: 提交的消息 - {0}

source: Message for Selected Commit
zh_cn: 选择提交的信息

source: Method '{1}' on object '{0}' failed because {2}
zh_cn: 对象“{0}”上的方法“{1}”失败，因为{2}

source: Method '{1}' on object '{0}' failed due to mismatching parameter count
zh_cn: 对象“{0}”上的方法“{1}”由于参数计数不匹配而失败

source: Micro Web Server
zh_cn: 微型网络服务器

source: Micro Web Server Window
zh_cn: 微型网络服务器窗口

source: Microsoft 64bit Windows 10
zh_cn: Microsoft Windows 10 64位

source: Microsoft 64bit Windows 7
zh_cn: Microsoft Windows 7 64位

source: Microsoft Stats System
zh_cn: Microsoft 统计系统

source: Microsoft Xbox One Directory
zh_cn: Microsoft Xbox One 目录

source: Middle
zh_cn: 中键

source: Middle Center
zh_cn: 中心

source: Middle Centre
zh_cn: 中心

source: Middle Down
zh_cn: 中键压住

source: Middle Left
zh_cn: 左中

source: Middle Pressed
zh_cn: 中键按下

source: Middle Released
zh_cn: 中键放开

source: Middle Right
zh_cn: 右中

source: Min
zh_cn: 最小

source: Min Angle
zh_cn: 最小角度

source: Min Color
zh_cn: 最小颜色

source: Min Colour
zh_cn: 最小颜色值

source: Min Dir
zh_cn: 最小方向

source: Min Life
zh_cn: 最小生命周期

source: Min Size
zh_cn: 最小尺寸

source: Min Speed
zh_cn: 最小速度

source: Minimize
zh_cn: 最小化

source: Minimum
zh_cn: 最小化

source: Minimum SDK
zh_cn: 最小 SDK

source: Minimum code window height
zh_cn: 最小代码窗口高度

source: Minimum code window width
zh_cn: 最小代码窗口宽度

source: Minimum size for DnD™ toolbox action thumbnails
zh_cn: DnD™工具栏动作缩略图的最小尺寸

source: Minimum time to display
zh_cn: 最短显示时间

source: Minimum zoom (%)
zh_cn: 最小缩放倍数 (%)

source: Minimum zoom level for interacting with window contents (%)
zh_cn: 与窗口内容交互的最小缩放级别（％）

source: Minimum zoom level to allow mouse interaction with window contents
zh_cn: 允许鼠标与窗口内容互动的最小缩放级别

source: Minus(-) / Numpad Minus
zh_cn: 减号(-) / 小键盘减号

source: Mirror
zh_cn: 镜像

source: Mirror (X)
zh_cn: 镜像(X)

source: Mirror brush tool
zh_cn: 镜像笔刷工具

source: Mirror the current brush along the X axis
zh_cn: 将当前画刷沿X轴镜像

source: Mirror the path
zh_cn: 镜像该路径

source: Mirror the tile
zh_cn: 镜像该图块

source: Mirror the tile or brush
zh_cn: 镜像图块或画刷

source: Misc
zh_cn: 杂项

source: Miscellaneous
zh_cn: 杂项

source: Missing audiogroup for sound: '{0}' - setting to default audio group
zh_cn: 缺少声音的音频组：“{0}” - 设置为默认音频组

source: Mixed
zh_cn: 混合

source: Mobile
zh_cn: Mobile（移动端）

source: Mode
zh_cn: 模式

source: Modifiers
zh_cn: 修饰符键

source: Modify Collision Shape
zh_cn: 修改碰撞形状

source: Modules
zh_cn: 模块

source: Moment
zh_cn: 时刻

source: Moment {0}
zh_cn: 时刻 {0}

source: Mono
zh_cn: 单声道

source: More
zh_cn: 更多

source: More information on this can be found further down this page in the section on Physics.
zh_cn: 有关这方面的更多信息，请参见物理学部分的下一页。

source: Most Compatible
zh_cn: 最大兼容的

source: Most compiler error messages follow the same outline, with a message stating the object that the error has occurred in, then the Event along with the line number, and then finally a short description of the error itself.
zh_cn: 大多数编译器错误消息遵循相同的模式，其中包含一条消息，指示物体发生错误，然后是事件与行号，最后简要描述错误本身。

source: Most of the time they have a sprite associated with them so that you can see them in the game rooms, but sometimes they are used as a "behind the scenes" controller to do things related to the user or for timing, etc...
zh_cn: 大多数时候，他们会有一个与其相关联的精灵，以便可以在游戏房间中看到他们，但有时他们被用作“幕后” 控制器 来做与用户有关的事情或计时等。

source: Most of the time they have a sprite associated with them so that you see them in the game room, but sometimes they are used as a "behind the scenes" controller to do things related to the user or for timing, etc...
zh_cn: 大多数时候这些物体都会关联一个精灵以便可以在房间中看见。但有时候它们也被用作“幕后”控制器来做与用户或时间相关的事情。
